anhdong2194/robot-charger/AGV_STM32_Charge_Station - Dong Ho/Src/main.c
/**
  ******************************************************************************
  * File Name          : main.c
  * Description        : Main program body
  ******************************************************************************
  ** This notice applies to any and all portions of this file
  * that are not between comment pairs USER CODE BEGIN and
  * USER CODE END. Other portions of this file, whether 
  * inserted by the user or by software development tools
  * are owned by their respective copyright owners.
  *
  * COPYRIGHT(c) 2018 STMicroelectronics
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of STMicroelectronics nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */
/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "stm32f1xx_hal.h"
#include "math.h"

#define State_1  0
#define State_2  1
#define State_3	 2
#define State_4	 3

#define Not_yet   0
#define Full		 1

#define Station_ID 	  	3000
#define Waiting 				6000
#define Charge_Start 		6001
#define Charging 	    	6002
#define Reset_Workflow 	6003

#define Charge_waiting 			7000
#define Charge_motor_error 	7001
#define Charge_charging			7002
#define Charge_full					7003
#define Charge_prepare			7004
#define Charge_reset				7005
#define Charge_unknown			7006

#define Charge_Enable HAL_GPIO_WritePin(GPIOB,Charge_Pin,GPIO_PIN_SET);
#define Charge_Disable HAL_GPIO_WritePin(GPIOB,Charge_Pin,GPIO_PIN_RESET);

#define Operator_On HAL_GPIO_WritePin(GPIOB,Operator_Light_Pin,GPIO_PIN_SET);
#define Operator_Off HAL_GPIO_WritePin(GPIOB,Operator_Light_Pin,GPIO_PIN_RESET);

#define Error_On HAL_GPIO_WritePin(GPIOB,Error_Light_Pin,GPIO_PIN_SET);
#define Error_Off HAL_GPIO_WritePin(GPIOB,Error_Light_Pin,GPIO_PIN_RESET);

#define Buzzer_On HAL_GPIO_WritePin(GPIOB,Buzzer_Pin,GPIO_PIN_SET);
#define Buzzer_Off HAL_GPIO_WritePin(GPIOB,Buzzer_Pin,GPIO_PIN_RESET);

#define THERMISTORNOMINAL 10000 
#define TEMPERATURENOMINAL 25 
#define NUMSAMPLES 5
#define BCOEFFICIENT 3950
#define SERIESRESISTOR 10000 
uint16_t samples[NUMSAMPLES];

/* Private variables ---------------------------------------------------------*/
ADC_HandleTypeDef hadc1;
DMA_HandleTypeDef hdma_adc1;

TIM_HandleTypeDef htim1;
TIM_HandleTypeDef htim2;
TIM_HandleTypeDef htim3;
TIM_HandleTypeDef htim4;

UART_HandleTypeDef huart1;
DMA_HandleTypeDef hdma_usart1_rx;

/* USER CODE BEGIN PV */
/* Private variables ---------------------------------------------------------*/

/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_DMA_Init(void);
static void MX_USART1_UART_Init(void);
static void MX_TIM1_Init(void);
static void MX_TIM2_Init(void);
static void MX_TIM3_Init(void);
static void MX_TIM4_Init(void);
static void MX_ADC1_Init(void);
                                    
void HAL_TIM_MspPostInit(TIM_HandleTypeDef *htim);
                                
void get_data(void);
void battery_indicator(void);
void error_blink(int i);
void Operator_blink();
/*------------ Timer delay -------------*/
void delay_us(uint16_t microseconds);

void Motor_Forward(void);
void Motor_Backward(void);
void Motor_Off(void);
/* Private function prototypes -----------------------------------------------*/

//ADC
//================================================================================//
volatile uint16_t adc1_value[3];
int adc1_value_temp = 0;
float adc1_value_batt = 0;
float NTC_value = 0;
float min_diff = 1000;
float batt_temp ;
int count = 0;
int bat_full_flag = 0;
int flag = 0;
//-20 => 105
/*
float Temp_lookup_table[126] = {\
		 70.5811, 67.2987, 64.1834, 61.2233, 58.4080, 55.7284, 53.1766, 50.7456, 48.4294, 46.2224, 44.1201, 42.1180, 40.2121\
		,38.3988, 36.6746, 35.0362, 33.4802, 32.0035, 30.6028, 29.2750, 28.0170, 26.8255, 25.6972, 24.6290, 23.6176, 22.6597\
		,21.7522, 20.8916, 20.0749, 19.2988, 18.5600, 18.4818, 18.1489, 17.6316, 16.9917, 16.2797, 15.5350, 14.7867, 14.0551\
		,13.3536, 12.6900, 12.0684, 11.4900, 10.9539, 10.4582, 10.0000, 9.5762,  9.1835,  8.8186,  8.4784,  8.1600,  7.8608\
		,7.5785,  7.3109,  7.0564,  6.8133,  6.5806,  6.3570,  6.1418,  5.9343,  5.7340,  5.5405,  5.3534,  5.1725,  4.9976\
		,4.8286,  4.6652,  4.5073,  4.3548,  4.2075,  4.0650,	 3.9271,  3.7936,  3.6639,  3.5377,  3.4146,  3.2939,  3.1752\
	  ,3.0579,  2.9414,  2.8250,  2.7762,  2.7179,  2.6523,  2.5817,  2.5076,  2.4319,  2.3557,  2.2803,  2.2065,  2.1350\
    ,2.0661,  2.0004,  1.9378,  1.8785,  1.8225,  1.7696,  1.7197,  1.6727,  1.6282,  1.5860,  1.5458,  1.5075,  1.4707\
	  ,1.4352,  1.4006,  1.3669,  1.3337,  1.3009,  1.2684,  1.2360,  1.2037,  1.1714,  1.1390,  1.1067,  1.0744,  1.0422\
    ,1.0104,  0.9789,  0.9481,  0.9180,  0.8889,  0.85,    0.8346,  0.8099,  0.7870};
*/
//UART WIFI
//================================================================================//
uint8_t buffer[100],receive_data[6];
uint8_t data_complete = 0, data_len = 0;
uint16_t data_id = 0;
uint8_t len = 0;
uint8_t data_order = 0, data_order_2 = 0;
uint8_t data_reorder[6];

//WORKFLOW
//================================================================================//
uint8_t workflow = 0, lms_ = 1, wait_motor = 0, charge_complete = 0;

double temp_calculate(int adc)
{

    double Temp;

    double ara;        //(10000*((4096/(adc-1))));

    ara=adc-1;

    ara=4096/ara;

    ara=ara*10000;

    Temp = log(ara);
   //         =log(10000/(4095/adc-1)) // for pull-up configuration


    Temp=pow(Temp,2);


