anhdong2194/robot-charger/AGV_STM32_Charge_Station - Dong Ho/Src/main.c
    Temp=Temp*0.0000000876741;

    Temp=Temp+0.000234125;

    Temp=Temp*(log(ara));

    Temp=Temp+0.001129148;

    Temp=(1/Temp);

    //Temp = log(10000.0*((1024.0/RawADC-1)))
    //Temp = 1 / (0.001129148 + (0.000234125 + (0.0000000876741 * Temp * Temp ))* Temp )


    Temp = Temp - 273.15;            // Convert Kelvin to Celcius

    // Temp = (Temp * 9.0)/ 5.0 + 32.0; // Convert Celcius to Fahrenheit

    return Temp;


}


int main(void)
{
  /* MCU Configuration----------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* Configure the system clock */
  SystemClock_Config();

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_DMA_Init();
  MX_USART1_UART_Init();
  MX_TIM1_Init();
  MX_TIM2_Init();
  MX_TIM3_Init();
  MX_TIM4_Init();
  MX_ADC1_Init();
	
	HAL_TIM_Base_Start(&htim4);
  HAL_TIM_Base_Start_IT(&htim3);
	//---Battery LED---
	HAL_GPIO_WritePin(GPIOB,Batt_lvl_1_Pin,GPIO_PIN_SET	);
	HAL_GPIO_WritePin(GPIOB,Batt_lvl_2_Pin,GPIO_PIN_SET);
	HAL_GPIO_WritePin(GPIOB,Batt_lvl_3_Pin,GPIO_PIN_SET);
	HAL_GPIO_WritePin(GPIOB,Batt_lvl_4_Pin,GPIO_PIN_SET);
	HAL_GPIO_WritePin(GPIOB,Batt_lvl_5_Pin,GPIO_PIN_SET);
	
	//---Error Light---//0 = off
	Error_Off;
	//---Operator Light---//0 = off
	Operator_Off;
	//---Buzzer---//0 = off
	Buzzer_Off;
	
	//---Charge---//0 = off
	Charge_Disable;
	//---Motor---//0 = off
	Motor_Off();
	
	//---UART DMA---
	len = sizeof(receive_data)/sizeof(receive_data[0]);
	HAL_UART_Receive_DMA(&huart1,receive_data,len);

	//---ADC DMA---
	HAL_ADC_Start_DMA(&hadc1,(uint32_t*) adc1_value,3);
	HAL_Delay(1000);
  
  /* USER CODE BEGIN WHILE */
  while (1)
  {
		//Get DMA data
		get_data();
		
		//Auto restart if temp too high
		if (adc1_value_temp >= 90){
						snprintf((char*)buffer, sizeof buffer\
						,"%s%d%s%d%s%d%s%.1f%s"\
						,"{\"id\":",Station_ID,",\"status\":",Charge_reset,",\"temp\":",adc1_value_temp,",\"batt\":",adc1_value_batt,"}\n");//r
						HAL_UART_Transmit_IT(&huart1,buffer, sizeof buffer);
						Charge_Disable;
						Motor_Backward();
						while(wait_motor <= 100){
							delay_us(50000);
							wait_motor++;
						}
						for (int i=0; i<len; i++) receive_data[i] = '\0';
						data_complete = 0;
						workflow = State_1;
						Error_On;
						Operator_Off;
		}
		if (adc1_value_batt <=2){
			count +=1;
			if (count >= 50){
						snprintf((char*)buffer, sizeof buffer\
				,"%s%d%s%d%s%d%s%.1f%s"\
				,"{\"id\":",Station_ID,",\"status\":",Charge_reset,",\"temp\":",adc1_value_temp,",\"batt\":",adc1_value_batt,"}\n");//r
			HAL_UART_Transmit_IT(&huart1,buffer, sizeof buffer);
			Charge_Disable;
			Motor_Backward();
			while(wait_motor <= 100){
				delay_us(50000);
				wait_motor++;
			}
			for (int i=0; i<len; i++) receive_data[i] = '\0';
			data_complete = 0;
			workflow = State_1;
			Error_Off;
			Operator_Off;
			count = 0;
		}
	}
		//Response to server while waiting
		if ((data_complete == 1)&&(data_id == Waiting)&&(workflow == State_1)){
			snprintf((char*)buffer, sizeof buffer\
				,"%s%d%s%d%s%d%s%.1f%s"\
				,"{\"id\":",Station_ID,",\"status\":",Charge_waiting,",\"temp\":",adc1_value_temp,",\"batt\":",adc1_value_batt,"}\n");//r
			HAL_UART_Transmit_IT(&huart1,buffer, sizeof buffer);
			for (int i=0; i<len; i++) receive_data[i] = '\0';
			data_complete = 0;
			//charge_complete = 0;
			Error_Off;
			Operator_Off;
			count = 0;
		}
		//Response to server while starting to charge
		else if ((data_complete == 1)&&(data_id == Charge_Start)&&(workflow == State_1)){
			Motor_Forward();
			//HAL_Delay(500);
			snprintf((char*)buffer, sizeof buffer\
				,"%s%d%s%d%s%d%s%.1f%s"\
				,"{\"id\":",Station_ID,",\"status\":",Charge_prepare,",\"temp\":",adc1_value_temp,",\"batt\":",adc1_value_batt,"}\n");//r
			HAL_UART_Transmit_IT(&huart1,buffer, sizeof buffer);
			wait_motor = 0;
			while(wait_motor <= 100){
				delay_us(50000);
				wait_motor++;
				Error_Off;
				Operator_On;
			}
			
			if (HAL_GPIO_ReadPin(GPIOB,Charge_LMS_Pin) == 1 ){
				lms_ = 1;
				workflow = State_3;
				Error_On;
				Operator_Off;
				count = 0;
			}
			else if (HAL_GPIO_ReadPin(GPIOB,Charge_LMS_Pin) == 0){
				int temp_wait = 0;
				while(wait_motor <= 60){
				delay_us(50000);
				temp_wait++;
				}
				if (adc1_value_batt <=2){
					lms_ = 1;
					Operator_Off;
					//Error_On;
					error_blink(10);
					workflow = State_4;
					count = 0;
					/*
					Motor_Backward();
					wait_motor = 0;
					while(wait_motor <= 100){
						delay_us(50000);
						wait_motor++;
					}
					*/
					
				}
				else{
					lms_ = 0;
					workflow = State_2;
					Charge_Enable;
					Error_Off;
					Operator_On;
					count = 0;
				}
			}
			
			Motor_Off();
			data_complete = 0;
			for (int i=0; i<len; i++) receive_data[i] = '\0';
		}
		//Response to server while motor error
		else if ((data_complete == 1)&&(data_id == Charging)&&(workflow == State_3)){
			snprintf((char*)buffer, sizeof buffer\
				,"%s%d%s%d%s%d%s%.1f%s"\
				,"{\"id\":",Station_ID,",\"status\":",Charge_motor_error,",\"temp\":",adc1_value_temp,",\"batt\":",adc1_value_batt,"}\n");//r
			HAL_UART_Transmit_IT(&huart1,buffer, sizeof buffer);
			for (int i=0; i<len; i++) receive_data[i] = '\0';
			data_complete = 0;
			data_id = Reset_Workflow;
		}
		// error when no robot to charge
		else if (workflow == State_4){
			Charge_Disable;
			Motor_Backward();
			while(wait_motor <= 100){
				delay_us(50000);
				wait_motor++;
			}
			data_complete = 0;
			workflow = State_1;
			Error_Off;
			Operator_Off;
		}
		//Response to server while charging
		else if ((data_complete == 1)&&(data_id == Charging)&&(workflow == State_2)){
			flag = 0;
			if ((adc1_value_batt < 29.0)&&(flag == 0)){
				snprintf((char*)buffer, sizeof buffer\
				,"%s%d%s%d%s%d%s%.1f%s"\
				,"{\"id\":",Station_ID,",\"status\":",Charge_charging,",\"temp\":",adc1_value_temp,",\"batt\":",adc1_value_batt,"}\n");//r
			
			HAL_UART_Transmit_IT(&huart1,buffer, sizeof buffer);
			for (int i=0; i<len; i++) receive_data[i] = '\0';
			data_complete = 0;
			bat_full_flag = 0;
			flag = 1;
		}
			else{
				snprintf((char*)buffer, sizeof buffer\
				,"%s%d%s%d%s%d%s%.1f%s"\
				,"{\"id\":",Station_ID,",\"status\":",Charge_charging,",\"temp\":",adc1_value_temp,",\"batt\":",adc1_value_batt,"}\n");//r
			
