anhdong2194/robot-charger/AGV_STM32_Charge_Station - Dong Ho/Src/main.c
			HAL_UART_Transmit_IT(&huart1,buffer, sizeof buffer);
			for (int i=0; i<len; i++) receive_data[i] = '\0';
			data_complete = 0;
			bat_full_flag +=1;	
			flag = 1;
			}
		}
		//Reset charge station workflow
		else if ((data_complete == 1)&&(data_id == Reset_Workflow)){
			snprintf((char*)buffer, sizeof buffer\
				,"%s%d%s%d%s%d%s%.1f%s"\
				,"{\"id\":",Station_ID,",\"status\":",Charge_reset,",\"temp\":",adc1_value_temp,",\"batt\":",adc1_value_batt,"}\n");//r
			HAL_UART_Transmit_IT(&huart1,buffer, sizeof buffer);
			Charge_Disable;
			Motor_Backward();
			while(wait_motor <= 100){
				delay_us(50000);
				wait_motor++;
			}
			for (int i=0; i<len; i++) receive_data[i] = '\0';
			data_complete = 0;
			workflow = State_1;
			Error_Off;
			Operator_Off;
		}
		
		else if ((data_complete == 1)&&(data_id != Reset_Workflow)) {
			snprintf((char*)buffer, sizeof buffer\

				,"%s%d%s%d%s%d%s%.1f%s"\

				,"{\"id\":",Station_ID,",\"status\":",Charge_unknown,",\"temp\":",adc1_value_temp,",\"batt\":",adc1_value_batt,"}\n");//r

			

			HAL_UART_Transmit_IT(&huart1,buffer, sizeof buffer);

			for (int i=0; i<len; i++) receive_data[i] = '\0';

			data_complete = 0;

		}

		//Full condition
		if ((workflow == State_2)&&(bat_full_flag >= 6)){
			Charge_Disable;		
			snprintf((char*)buffer, sizeof buffer\
				,"%s%d%s%d%s%d%s%.1f%s"\
				,"{\"id\":",Station_ID,",\"status\":",Charge_full,",\"temp\":",adc1_value_temp,",\"batt\":",adc1_value_batt,"}\n");//r
			HAL_UART_Transmit_IT(&huart1,buffer, sizeof buffer);
			for (int i=0; i<len; i++) receive_data[i] = '\0';
			data_complete = 0;
			
			delay_us(5000);
			Motor_Backward();
			wait_motor = 0;
			while(wait_motor <= 100){
				delay_us(50000);
				wait_motor++;
			}
			Error_Off;
			Operator_On;
			count = 0;
			bat_full_flag = 0;
	}
		
		//while charging show battery lvl
		if (workflow == State_2)
			battery_indicator();
		else if(workflow != State_2){
			if(workflow == State_1){
				Operator_blink();
			}
				HAL_GPIO_WritePin(GPIOB,Batt_lvl_1_Pin,GPIO_PIN_SET);
				HAL_GPIO_WritePin(GPIOB,Batt_lvl_2_Pin,GPIO_PIN_SET);
				HAL_GPIO_WritePin(GPIOB,Batt_lvl_3_Pin,GPIO_PIN_SET);
				HAL_GPIO_WritePin(GPIOB,Batt_lvl_4_Pin,GPIO_PIN_SET);
				HAL_GPIO_WritePin(GPIOB,Batt_lvl_5_Pin,GPIO_PIN_SET);
		}			
  }
}

/** System Clock Configuration
*/
void HAL_TIM_PeriodElapsedCallback(TIM_HandleTypeDef *htim)
{
	if (htim->Instance==htim3.Instance)
	{	
		//Battery calc
		//adc1_value_batt = adc1_value[0]*0.00764432f;
		float adc1_batt_total = 0;
		for (int i = 0;i<16;i++)
		{
			 adc1_batt_total += adc1_value[0];
			 delay_us(100);
		}
		batt_temp += ((adc1_batt_total/16) - batt_temp)*0.1;
		adc1_value_batt = batt_temp*0.007645756633f;//charge_1:ID:1000:0.00764432f//charge_2:ID:2000:0.0076330722787276f//charge_3:ID:3000:0.007645756633f
		//Temp of charge station
		/*
		NTC_value = (10.89 * adc1_value[1])/(13513.5 - (3.3 * adc1_value[1]));
		min_diff = 1000;
		for (int i = 0; i<126; i++){
			if (fabs(Temp_lookup_table[i] - NTC_value) <= min_diff){
				min_diff = fabs(Temp_lookup_table[i] - NTC_value);
				adc1_value_temp = i - 20;
			}
		}
		
		uint8_t i;
		float average;
 
		// take N samples in a row, with a slight delay
		for (i=0; i< NUMSAMPLES; i++) {
		samples[i] = adc1_value[1];
		}
 
		// average all the samples out
		average = 0;
		for (i=0; i< NUMSAMPLES; i++) {
			average += samples[i];
		}
		average /= NUMSAMPLES;
 
 
		// convert the value to resistance
		average = 4095 / average - 1;
		average = SERIESRESISTOR / average;

		float steinhart;
		steinhart = average / THERMISTORNOMINAL;     // (R/Ro)
		steinhart = log(steinhart);                  // ln(R/Ro)
		steinhart /= BCOEFFICIENT;                   // 1/B * ln(R/Ro)
		steinhart += 1.0 / (TEMPERATURENOMINAL + 273.15); // + (1/To)
		steinhart = 1.0 / steinhart;                 // Invert
		steinhart -= 273.15;
		adc1_value_temp = steinhart;
		*/
		adc1_value_temp = temp_calculate(adc1_value[1]);
	}
}


void error_blink(int i){
	for(int a = 0; a<i;a++)
	{
	HAL_GPIO_TogglePin(GPIOB,Error_Light_Pin);
	HAL_Delay(500);
	}
}
void Operator_blink(){
	HAL_GPIO_TogglePin(GPIOB,Operator_Light_Pin);
	HAL_Delay(500);
}
void battery_indicator(void){
	//adc1_value_batt = adc1_value[0]*0.007531f;

	if (adc1_value_batt < 26){
		HAL_GPIO_WritePin(GPIOB,Batt_lvl_1_Pin,GPIO_PIN_RESET);
		HAL_GPIO_WritePin(GPIOB,Batt_lvl_2_Pin,GPIO_PIN_SET);
		HAL_GPIO_WritePin(GPIOB,Batt_lvl_3_Pin,GPIO_PIN_SET);
		HAL_GPIO_WritePin(GPIOB,Batt_lvl_4_Pin,GPIO_PIN_SET);
		HAL_GPIO_WritePin(GPIOB,Batt_lvl_5_Pin,GPIO_PIN_SET);
	}
	else if (adc1_value_batt < 27){
		HAL_GPIO_WritePin(GPIOB,Batt_lvl_1_Pin,GPIO_PIN_RESET);
		HAL_GPIO_WritePin(GPIOB,Batt_lvl_2_Pin,GPIO_PIN_RESET);
		HAL_GPIO_WritePin(GPIOB,Batt_lvl_3_Pin,GPIO_PIN_SET);
		HAL_GPIO_WritePin(GPIOB,Batt_lvl_4_Pin,GPIO_PIN_SET);
		HAL_GPIO_WritePin(GPIOB,Batt_lvl_5_Pin,GPIO_PIN_SET);
	}
	else if (adc1_value_batt < 28){
		HAL_GPIO_WritePin(GPIOB,Batt_lvl_1_Pin,GPIO_PIN_RESET);
		HAL_GPIO_WritePin(GPIOB,Batt_lvl_2_Pin,GPIO_PIN_RESET);
		HAL_GPIO_WritePin(GPIOB,Batt_lvl_3_Pin,GPIO_PIN_RESET);
		HAL_GPIO_WritePin(GPIOB,Batt_lvl_4_Pin,GPIO_PIN_SET);
		HAL_GPIO_WritePin(GPIOB,Batt_lvl_5_Pin,GPIO_PIN_SET);
	}
	else if (adc1_value_batt < 29){
		HAL_GPIO_WritePin(GPIOB,Batt_lvl_1_Pin,GPIO_PIN_RESET);
		HAL_GPIO_WritePin(GPIOB,Batt_lvl_2_Pin,GPIO_PIN_RESET);
		HAL_GPIO_WritePin(GPIOB,Batt_lvl_3_Pin,GPIO_PIN_RESET);
		HAL_GPIO_WritePin(GPIOB,Batt_lvl_4_Pin,GPIO_PIN_RESET);
		HAL_GPIO_WritePin(GPIOB,Batt_lvl_5_Pin,GPIO_PIN_SET);
	}
	else if (adc1_value_batt >= 29.3){
		HAL_GPIO_WritePin(GPIOB,Batt_lvl_1_Pin,GPIO_PIN_RESET);
		HAL_GPIO_WritePin(GPIOB,Batt_lvl_2_Pin,GPIO_PIN_RESET);
		HAL_GPIO_WritePin(GPIOB,Batt_lvl_3_Pin,GPIO_PIN_RESET);
		HAL_GPIO_WritePin(GPIOB,Batt_lvl_4_Pin,GPIO_PIN_RESET);
		HAL_GPIO_WritePin(GPIOB,Batt_lvl_5_Pin,GPIO_PIN_RESET);
	}
}

void Motor_Forward(void){
	HAL_GPIO_WritePin(GPIOB,Forward_Motor_Pin,GPIO_PIN_SET);
	HAL_GPIO_WritePin(GPIOB,Backward_Motor_Pin,GPIO_PIN_RESET);
}

void Motor_Backward(void){
	HAL_GPIO_WritePin(GPIOB,Forward_Motor_Pin,GPIO_PIN_RESET);
	HAL_GPIO_WritePin(GPIOB,Backward_Motor_Pin,GPIO_PIN_SET);
}

void Motor_Off(void){
	HAL_GPIO_WritePin(GPIOB,Forward_Motor_Pin,GPIO_PIN_RESET);
	HAL_GPIO_WritePin(GPIOB,Backward_Motor_Pin,GPIO_PIN_RESET);
}

void get_data(void)
{
		//find the order of data
		for (int i = 0; i<len; i++){
			if (receive_data[i] == 'c')
				data_order = i;
		}
		
		if (data_order != 0){
			for (int i = 0; i<len; i++){
				data_reorder[i] = receive_data[data_order];
				data_order_2 = i+1;
				data_order++;
				if (data_order == len)
					break;
			}
			for (int i = 0; i<len; i++){
				data_reorder[data_order_2] = receive_data[i];
				data_order_2++;
				if (data_order_2 == len)
					break;
			}
		}
		else{
			for (int i = 0; i<len; i++){
				data_reorder[i] = receive_data[i];
			}
		}
		
		//find the start and stop
		if ((data_reorder[0] == 'c')&&(data_reorder[5] == 'e')){
			data_complete = 1;
			uint16_t dec = 1000;
			data_id = 0;
			for (int i = 1; i<len; i++){
				if (data_reorder[i] == 'e') break;
				data_id = data_id + ((data_reorder[i] - '0')*dec);
				dec = dec/10;
			}
		}
}

